app/controllers/members_controller.rb

INSERT INTO "members" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Evira"], ["password", "team leader"], ["created_at", 2016-10-04 17:16:07 UTC], ["updated_at", 2016-10-04 17:16:07 UTC]]
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

UPDATE "members" SET "username" = ?, "password" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["username", "Elvis"], ["password", "good"], ["updated_at", 2016-10-08 13:38:19 UTC], ["id", 195]]
---
  def update
    respond_to do |format|
      if @member.update(member_params)

DELETE FROM "members" WHERE "members"."id" = ?  [["id", 15]]
---
  def destroy
    @member.destroy